using System;
using System.Collections.Generic;

namespace StudentGrade
{
    class Student
    {
        public double chn { get; set; }
        public double eng { get; set; }
        public double math { get; set; }
        public double tol { get; set; }
        public double avg { get; set; }

        public void CalculateTol()
        {
            tol = (chn + eng + math);
        }

        public void CalculateAvg()
        {
            avg = Math.Round((chn + eng + math) / 3);
        }
    }

    class Sort
    {
        public static void BubbleSort(double[] list)
        {
            for (int i = 0; i < list.Length; i++)
            {
                for (int j = 0; j < list.Length - 1; j++)
                {
                    if (list[j] > list[j + 1])
                    {
                        double temp = list[j];
                        list[j] = list[j + 1];
                        list[j + 1] = temp;
                    }
                }
            }
        }
        public static void BubbleSort(int[] list)
        {
            for (int i = 0; i < list.Length; i++)
            {
                for (int j = 0; j < list.Length - 1; j++)
                {
                    if (list[j] > list[j + 1])
                    {
                        int temp = list[j];
                        list[j] = list[j + 1];
                        list[j + 1] = temp;
                    }
                }
            }
        }
        public static void BubbleSort(string[,] list)
        {
            for (int i = 0; i < list.Length; i++)
            {
                for (int j = 0; j < list.GetLength(0) - 1; j++)
                {
                    if (int.Parse(list[j, 0]) > int.Parse(list[j + 1, 0]))
                    {
                        for (int x = 0; x < 2; x++)
                        {
                            var temp = list[j, x];
                            list[j, x] = list[j + 1, x];
                            list[j + 1, x] = temp;
                        }
                    }
                }

            }
        }
    }

    class Name
    {
        public List<string> firstname = new List<string>() {
        "趙", "錢", "孫", "李", "週", "吳", "鄭", "王", "馮", "陳", "楮", "衛", "蔣", "沈", "韓", "楊",
        "朱", "秦", "尤", "許", "何", "呂", "施", "張", "孔", "曹", "嚴", "華", "金", "魏", "陶", "薑",
        "戚", "謝", "鄒", "喻", "柏", "水", "竇", "章", "雲", "蘇", "潘", "葛", "奚", "範", "彭", "郎",
        "魯", "韋", "昌", "馬", "苗", "鳳", "花", "方", "俞", "任", "袁", "柳", "酆", "鮑", "史", "唐",
        "費", "廉", "岑", "薛", "雷", "賀", "倪", "湯", "滕", "殷", "羅", "畢", "郝", "鄔", "安", "常",
        "樂", "於", "時", "傅", "皮", "卞", "齊", "康", "伍", "餘", "元", "蔔", "顧", "孟", "平", "黃",
        "和", "穆", "蕭", "尹", "姚", "邵", "湛", "汪", "祁", "毛", "禹", "狄", "米", "貝", "明", "臧",
        "計", "伏", "成", "戴", "談", "宋", "茅", "龐", "熊", "紀", "舒", "屈", "項", "祝", "董", "梁",
        "杜", "阮", "藍", "閩", "席", "季", "麻", "強", "賈", "路", "婁", "危", "江", "童", "顏", "郭",
        "梅", "盛", "林", "刁", "鍾", "徐", "丘", "駱", "高", "夏", "蔡", "田", "樊", "胡", "淩", "霍",
        "虞", "萬", "支", "柯", "昝", "管", "盧", "莫", "經", "房", "裘", "繆", "幹", "解", "應", "宗",
        "丁", "宣", "賁", "鄧", "鬱", "單", "杭", "洪", "包", "諸", "左", "石", "崔", "吉", "鈕", "龔",
        "程", "嵇", "邢", "滑", "裴", "陸", "榮", "翁", "荀", "羊", "於", "惠", "甄", "麴", "家", "封",
        "芮", "羿", "儲", "靳", "汲", "邴", "糜", "松", "井", "段", "富", "巫", "烏", "焦", "巴", "弓",
        "牧", "隗", "山", "穀", "車", "侯", "宓", "蓬", "全", "郗", "班", "仰", "秋", "仲", "伊", "宮",
        "寧", "仇", "欒", "暴", "甘", "斜", "厲", "戎", "祖", "武", "符", "劉", "景", "詹", "束", "龍",
        "葉", "幸", "司", "韶", "郜", "黎", "薊", "薄", "印", "宿", "白", "懷", "蒲", "邰", "從", "鄂",
        "索", "鹹", "籍", "賴", "卓", "藺", "屠", "蒙", "池", "喬", "陰", "鬱", "胥", "能", "蒼", "雙",
        "聞", "莘", "黨", "翟", "譚", "貢", "勞", "逄", "姬", "申", "扶", "堵", "冉", "宰", "酈", "雍",
        "郤", "璩", "桑", "桂", "濮", "牛", "壽", "通", "邊", "扈", "燕", "冀", "郟", "浦", "尚", "農",
        "溫", "別", "莊", "晏", "柴", "瞿", "閻", "充", "慕", "連", "茹", "習", "宦", "艾", "魚", "容",
        "向", "古", "易", "慎", "戈", "廖", "庾", "終", "暨", "居", "衡", "步", "都", "耿", "滿", "弘",
        "匡", "國", "文", "寇", "廣", "祿", "闕", "東", "歐", "殳", "沃", "利", "蔚", "越", "夔", "隆",
        "師", "鞏", "厙", "聶", "晁", "勾", "敖", "融", "冷", "訾", "辛", "闞", "那", "簡", "饒", "空",
        "曾", "毋", "沙", "乜", "養", "鞠", "須", "豐", "巢", "關", "蒯", "相", "查", "後", "荊", "紅",
        "遊", "竺", "權", "逑", "蓋", "益", "桓", "公", "仉", "督", "晉", "楚", "閻", "法", "汝", "鄢",
        "塗", "欽", "嶽", "帥", "緱", "亢", "況", "後", "有", "琴", "歸", "海", "墨", "哈", "譙", "笪",
        "年", "愛", "陽", "佟", "商", "牟", "佘", "佴", "伯", "賞",
        "萬俟", "司馬", "上官", "歐陽", "夏侯", "諸葛", "聞人", "東方", "赫連", "皇甫", "尉遲", "公羊",
        "澹臺", "公冶", "宗政", "濮陽", "淳於", "單于", "太叔", "申屠", "公孫", "仲孫", "軒轅", "令狐",
        "鍾離", "宇文", "長孫", "慕容", "鮮於", "閭丘", "司徒", "司空", "丌官", "司寇", "子車", "微生",
        "顓孫", "端木", "巫馬", "公西", "漆雕", "樂正", "壤駟", "公良", "拓拔", "夾穀", "宰父", "穀梁",
        "段幹", "百里", "東郭", "南門", "呼延", "羊舌", "梁丘", "左丘", "東門", "西門", "南宮"}; //501

        string lastName = "剛偉勇毅俊峰強軍平保東文輝力明永健世廣志義興良海山仁波寧貴福生龍元全國勝學祥才發武" +
            "新利清飛彬富順信子傑濤昌成康星光天達安岩中茂進林有堅和彪博誠先敬震振壯會思群豪心邦承樂紹功松善厚慶磊民友" +
            "裕河哲江超浩亮政謙亨奇固之輪翰朗伯宏言若鳴朋斌梁棟維啟克倫翔旭鵬澤晨辰士以建家致樹炎德行時泰盛雄琛鈞冠策騰楠榕風航弘"; //151

        Random rnd = new Random();
        public string GetName()
        {
            return firstname[rnd.Next(0,500)] + lastName[rnd.Next(0, 150)];
        }

    }

}
